### 4. 테이터프레임 테이터 조작

In [1]:
import pandas as  pd
import numpy as np

- 데이터 갯수 세기

In [2]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
df.iloc[2, 3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [3]:
df.count()           # 열(위,가로) 기준 숫자 개수 카운트 해줌것임

0    4
1    4
2    4
3    3
dtype: int64

In [4]:
import seaborn as sns
titanic =sns.load_dataset('titanic')
titanic.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [5]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

- 연습 문제 4.4.1
    - 타이타닉호 승객 데이터의 데이터 개수를 각 열마다 구해본다.

In [6]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

- 카테고리 값 세기

In [8]:
# 열 별로 센다
titanic['class'].value_counts()

class
Third     491
First     216
Second    184
Name: count, dtype: int64

In [9]:
titanic['embark_town'].value_counts()

embark_town
Southampton    644
Cherbourg      168
Queenstown      77
Name: count, dtype: int64

- 정렬

In [12]:
np.random.seed = 2023
df = pd.DataFrame(np.random.randint(40,101,size=(4,5)),
                  index=list('abcd'),columns=list('VWXYZ'))
df

    V   W   X   Y   Z
a  86  52  90  44  66
b  55  89  79  86  48
c  90  85  98  55  81
d  85  48  95  57  62

In [15]:
df.sort_values(by='V',ascending=False)

    V   W   X   Y   Z
c  90  85  98  55  81
a  86  52  90  44  66
d  85  48  95  57  62
b  55  89  79  86  48

In [18]:
#V열에 동일한 값이 있으면,동일한 값은 W 열을 보고 정렬
df2=df.sort_values(by=['V','W'],ascending=False)
df2

    V   W   X   Y   Z
c  90  85  98  55  81
a  86  52  90  44  66
d  85  48  95  57  62
b  55  89  79  86  48

In [19]:
df2.sort_index()

    V   W   X   Y   Z
a  86  52  90  44  66
b  55  89  79  86  48
c  90  85  98  55  81
d  85  48  95  57  62

- 연습 문제 4.4.2
    - sort_values 메서드를 사용하여 타이타닉호 승객에 대해 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive) 인원수를 구하라.

In [21]:
print(titanic['sex'].value_counts())
print(titanic['class'].value_counts())
print(titanic['alive'].value_counts())

sex
male      577
female    314
Name: count, dtype: int64
class
Third     491
First     216
Second    184
Name: count, dtype: int64
alive
no     549
yes    342
Name: count, dtype: int64

- 행/열 합계

In [22]:
df

    V   W   X   Y   Z
a  86  52  90  44  66
b  55  89  79  86  48
c  90  85  98  55  81
d  85  48  95  57  62

In [23]:
# 행 방향(열의 합계)
df.sum(axis=0)

V    316
W    274
X    362
Y    242
Z    257
dtype: int64

In [24]:
# 열 방향 (해의 합계)
df.sum(axis=1)

a    338
b    357
c    409
d    347
dtype: int64

In [25]:
#총접 열 만들기
df['총점'] =df.sum(axis=1)
df

    V   W   X   Y   Z   총점
a  86  52  90  44  66  338
b  55  89  79  86  48  357
c  90  85  98  55  81  409
d  85  48  95  57  62  347

In [33]:
#평균 열만들기
df['평균']= df[['V','W','X','Y','Z']].mean(axis=1)
df

    V   W   X   Y   Z   총점    평균
a  86  52  90  44  66  338  67.6
b  55  89  79  86  48  357  71.4
c  90  85  98  55  81  409  81.8
d  85  48  95  57  62  347  69.4

In [35]:
df['평균2'] = df.iloc[:,:5].mean(axis=1)
df

    V   W   X   Y   Z   총점    평균   평균2
a  86  52  90  44  66  338  67.6  67.6
b  55  89  79  86  48  357  71.4  71.4
c  90  85  98  55  81  409  81.8  81.8
d  85  48  95  57  62  347  69.4  69.4

In [37]:
# 행 추가 방법
df.loc['합계',:] = df.sum()
df

        V      W      X      Y      Z      총점     평균    평균2
a    86.0   52.0   90.0   44.0   66.0   338.0   67.6   67.6
b    55.0   89.0   79.0   86.0   48.0   357.0   71.4   71.4
c    90.0   85.0   98.0   55.0   81.0   409.0   81.8   81.8
d    85.0   48.0   95.0   57.0   62.0   347.0   69.4   69.4
합계  632.0  548.0  724.0  484.0  514.0  2902.0  580.4  580.4

- 연습 문제 4.4.3

In [42]:
import seaborn as sns
titanic =sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [44]:
# 타이타닉호 승객의 평균 나이를 구하라.
titanic['age'].mean()

29.69911764705882

In [55]:
#타이타닉호 승객중 여성 승객의 평균 나이를 구하라.
ft =titanic[titanic.sex == 'female']
ft.head(3)
ft.age.mean().round(2)

27.92

In [58]:
titanic[titanic.sex == 'female'].age.mean().round(2)

27.92

In [57]:
#타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하라.
titanic[(titanic.pclass == 1)& (titanic.sex == 'female')]['age'].mean().round(2)

34.61

- apply 변환

In [61]:
titanic.apply(lambda x: x.count())

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [63]:
df2

    V   W   X   Y   Z
c  90  85  98  55  81
a  86  52  90  44  66
d  85  48  95  57  62
b  55  89  79  86  48

In [64]:
# 각 열에서 최대값 - 최소값 한 결과 👀(x = 열을 의미함)
df2.apply(lambda x: x.max() - x.min())              # x는 각  colum(열)을 의미

V    35
W    41
X    19
Y    42
Z    33
dtype: int32

In [66]:
# V 열의 제곱수 
df.V.apply(lambda x: x * x )         # x는 한컬럼의 원소를 의미

a       7396.0
b       3025.0
c       8100.0
d       7225.0
합계    399424.0
Name: V, dtype: float64

In [67]:
#  타이타닉호의 승객 중 나이 20살을 기준으로 성인(adult)과 미성년자(child)를 구별하는 라벨 열
titanic['adult/child'] = titanic.age.apply(lambda x: 'adult' if x > 20 else 'child')
titanic.tail(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult

In [75]:
data = {
    'price':['1,200','2,500','3,300'],
    'text':['03.입출력.ipynb','04.고급인덱싱.ipynb','05.데이터의 조작.ipynb']
    }
df3 =pd.DataFrame(data)
df3

   price              text
0  1,200      03.입출력.ipynb
1  2,500    04.고급인덱싱.ipynb
2  3,300  05.데이터의 조작.ipynb

In [73]:
int('1,200'.replace(',',''))

1200

In [74]:
df3['정수']=df3.price.apply(lambda x: int(x.replace(',','')))
df3

   price    정수
0  1,200  1200
1  2,500  2500
2  3,300  3300

In [77]:
df3['구둣점제거'] = df3.text.apply(lambda x: x.replace('.',''))
df3

   price              text           구둣점제거
0  1,200      03.입출력.ipynb      03입출력ipynb
1  2,500    04.고급인덱싱.ipynb    04고급인덱싱ipynb
2  3,300  05.데이터의 조작.ipynb  05데이터의 조작ipynb

In [80]:
df3['구둣점제거'] = df3.text.apply(lambda x: x.replace('.',''))
df3

   price              text           구둣점제거
0  1,200      03.입출력.ipynb      03입출력ipynb
1  2,500    04.고급인덱싱.ipynb    04고급인덱싱ipynb
2  3,300  05.데이터의 조작.ipynb  05데이터의 조작ipynb

In [85]:
import re

def remove_korean(text):
    korean_pattern = re.compile('[ㄱ-ㅎㅏ-ㅣ가-힣]+')
    return korean_pattern.sub('', text)

df3['한글제거'] = df3.구둣점제거.apply(remove_korean)
df3

   price              text           구둣점제거      한글제거
0  1,200      03.입출력.ipynb      03입출력ipynb   03ipynb
1  2,500    04.고급인덱싱.ipynb    04고급인덱싱ipynb   04ipynb
2  3,300  05.데이터의 조작.ipynb  05데이터의 조작ipynb  05 ipynb